// 基础功能组件
import Plugin from '@ckeditor/ckeditor5-core/src/plugin'
// 按钮视图组件
import ButtonView from '@ckeditor/ckeditor5-ui/src/button/buttonview'

// 按钮的图标 SVG
const icon = `<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1024 1024">
  <g transform="translate(102.4, 102.4) scale(0.8)">
    <path d="M951.897334 124.889405c0-29.142737-23.64349-52.78725-52.788274-52.78725L652.766512 72.102155c-29.142737 0-52.788274 23.64349-52.788274 52.78725s23.644513 52.788274 52.788274 52.788274l117.167536 0-193.394638 197.36916c-20.309558 20.929682-19.795858 54.334489 1.13587 74.644047 20.928658 20.310581 54.333466 19.795858 74.644047-1.133823l194.001459-197.986213 0 120.661104c0 29.142737 23.644513 52.788274 52.78725 52.788274 29.143761 0 52.788274-23.644513 52.788274-52.788274L951.89631 160.081928c0-6.170536-1.070378-12.090363-3.01773-17.59575C950.826955 136.980791 951.897334 131.059941 951.897334 124.889405zM371.678626 575.439868 177.677167 773.428128 177.677167 652.768047c0-29.143761-23.64349-52.788274-52.78725-52.788274s-52.788274 23.64349-52.788274 52.788274l0 211.150024c0 6.170536 1.070378 12.090363 3.018753 17.59575-1.948375 5.505387-3.018753 11.425214-3.018753 17.59575 0 29.142737 23.644513 52.788274 52.788274 52.788274l246.341524 0c29.142737 0 52.788274-23.644513 52.788274-52.788274s-23.644513-52.78725-52.788274-52.78725L254.077208 846.322321l193.383382-197.371206c20.274766-20.912285 19.794835-54.333466-1.13587-74.644047C425.395038 553.99444 391.989207 554.511209 371.678626 575.439868z" p-id="1730" />
  </g>
</svg>
`

// 自定义组件需要继承基础组件
export default class FullScreen extends Plugin {
  // 重写基础组件的初始化函数
  init() {
    const {editor} = this
    // 将自定义按钮添加到当前编辑器的组件工厂
    editor.ui.componentFactory.add('fullScreen', locale => {
      // 获取当前编辑器的按钮视图
      const view = new ButtonView(locale)

      // 在按钮视图中注入自定义按钮的名称、图标
      view.set({
        label: '切换全屏',
        icon,
        // 开启提示，当鼠标悬浮到按钮上，会显示 label 指定的 fullscreen 字样
        tooltip: true
      })

      // 点击按钮
      view.on('execute', () => {
        // ckeditor 是挂载在传入 dom 后面的，有意思
        editor.ui.view.element.classList.toggle('full-screen')
      })

      // 返回修改后的视图内容
      return view
    })
  }
}
